Функция ПриветНеВозвращаемоеЗначение()
	
	
	Для сч = 1 по 1000 Цикл
		
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = НСтр("ru = 'В строке 11 табличной части Номенклатура не хватает "
		+ "; en = 'In line 11 of tabular section Nomenclature is missing' ")
		+ НедостающееКоличество + " " + ЕдиницаИзмеренияНоменклатуры;
		Сообщение.Поле = "Номенклатура[10].Количество";
		Сообщение.УстановитьДанные(ОбъектДанных);
		Сообщение.Сообщить();
		
		
	КонецЦикла;
	
	Возврат 1;
	
	
КонецФункции