
&НаСервереБезКонтекста
Функция ПолучитьЦенуТовара(Дата, Товар, ВидЦен)
	ЦенаТовара = РегистрыСведений.ЦеныТоваров.ПолучитьПоследнее(
		Дата, Новый Структура("Товар, ВидЦен", Товар, ВидЦен));
	Возврат ЦенаТовара.Цена;
КонецФункции

&НаСервереБезКонтекста
Процедура ВыполнитьНаСервере()
	
	
	Запрос = Новый Запрос();
	
	Запрос = Новый Запрос;

	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Справочник1.Ссылка.Наименование Как НаименованиеСсылка
		|ПОМЕСТИТЬ втСправочника
		|ИЗ
		|	Справочник.Справочник1 КАК Справочник1
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	втСправочника.Ссылка КАК Ссылка
		|ИЗ
		|	втСправочника КАК втСправочника";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		// Вставить обработку выборки ВыборкаДетальныеЗаписи



	КонецЦикла;
	
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьНаКлиенте(Команда)
	ВыполнитьНаСервяре();
КонецПроцедуры
